MBTI = {
    'I': [
        "혼자 조용한 시간을 가지는 것을 좋아하시나요?",
        "혼자 있을 때 에너지를 충전하는 것을 좋아하시나요?",
        "소수의 친한 친구들과 시간을 보내는 것을 즐기시나요?",
        "사람들과 대화할 때 신중하게 말하는 편인가요?"
    ],
    'E': [
        "내 친구들과 함께 시간을 보내는 것을 좋아하시나요?",
        "대화하는 동안에 다른 사람들의 에너지를 어떻게 느끼시나요?",
        "대다수 사람과 함께 있는 것을 즐기시나요?",
        "사람들과 대화할 때 쉽게 말하는 편인가요?"
    ],
    'S': [
        "실제 경험을 중시하시나요?",
        "세부 사항에 신경을 많이 쓰시나요?",
        "현재의 상황과 사실에 의존하는 경향이 있나요?",
        "실제로 일어나는 일에 집중하시나요?"
    ],
    'N': [
        "상상력을 자주 발휘하시나요?",
        "큰 그림을 그리고 아이디어를 추구하시나요?",
        "가능성과 잠재력에 관심을 가지는 편인가요?",
        "미래에 대한 가능성을 고려하는 편인가요?"
    ],
    'T': [
        "논리적인 결정을 내리는 것을 좋아하시나요?",
        "문제를 분석하고 논리적으로 해결하는 것을 선호하시나요?",
        "무엇이 옳고 그름을 판단할 때 논리적인 근거를 찾으시나요?",
        "논리적으로 문제를 해결하는 것이 중요하다고 생각하시나요?"
    ],
    'F': [
        "감정과 관계를 중요하게 생각하시나요?",
        "다른 사람들의 감정을 이해하고 고려하는 것을 선호하시나요?",
        "타인의 감정을 존중하고 그에 따라 행동하는 것을 중요하게 생각하시나요?",
        "타인과의 관계에서 조화와 조정을 추구하는 편인가요?"
    ],
    'J': [
        "계획을 세우고 구체적인 일정을 준수하는 것을 좋아하시나요?",
        "일을 끝내기 위해 목표를 설정하고 노력하는 편인가요?",
        "계획된 일정과 일관성 있는 생활을 중요하게 생각하시나요?",
        "계획을 세우고 일을 조직적으로 처리하는 것을 선호하시나요?"
    ],
    'P': [
        "일을 마칠 때까지 계속해서 옵션을 열어두는 편인가요?",
        "일정에 무리하지 않고 유연하게 일하는 것을 선호하시나요?",
        "새로운 기회와 경험을 즐기는 편인가요?",
        "일을 무작정 즐기고 순발력 있게 처리하는 것을 중요하게 생각하시나요?"
    ]
}
